<?php
//臺北市,新北市,桃園市,臺中市,臺南市,高雄市
//基隆市 新竹市 嘉義市
//宜蘭縣 新竹縣 苗栗縣 彰化縣 南投縣 雲林縣 嘉義縣 屏東縣 花蓮縣  臺東縣


//台北市 中正區,大同區,中山區,松山區,大安區,萬華區,信義區,士林區,北投區,內湖區,南港區,文山區
//新北市 板橋區,新莊區,中和區,永和區,土城區,樹林區,三峽區,鶯歌區,三重區,蘆洲區,五股區,泰山區,林口區,
//八里區,淡水區,三芝區,石門區,金山區,萬里區,汐止區,瑞芳區,貢寮區,平溪區,雙溪區,新店區,深坑區,石碇區,坪林區,烏來區

//桃園市   桃園區,中壢區,平鎮區,八德區,楊梅區,蘆竹區,大溪區,龍潭區,龜山區,大園區,觀音區,新屋區,復興區

//臺中市  中區,東區,南區,西區,北區,北屯區,西屯區,南屯區,太平區,大里區,霧峰區,烏日區,豐原區,后里區,石岡區,東勢區,新社區,
//潭子區,大雅區,神岡區,大肚區,沙鹿區,龍井區,梧棲區,清水區,大甲區,外埔區,大安區,和平區

//臺南市 中西區,東區,南區,北區,安平區,安南區,永康區,歸仁區,新化區,左鎮區,玉井區,楠西區,南化區,仁德區,關廟區,龍崎區,官田區,麻豆區,佳里區,
//西港區,七股區,將軍區,學甲區,北門區,新營區,後壁區,白河區,東山區,六甲區,下營區,柳營區,鹽水區,善化區,大內區,山上區,新市區,安定區

//高雄市  楠梓區,左營區,鼓山區,三民區,鹽埕區,前金區,新興區,苓雅區,前鎮區,旗津區,小港區,鳳山區,大寮區,鳥松區,林園區,仁武區,大樹區,大社區,岡山區,
//路竹區,橋頭區,梓官區,彌陀區,永安區,燕巢區,田寮區,阿蓮區,茄萣區,湖內區,旗山區,美濃區,內門區,杉林區,甲仙區,六龜區,茂林區,桃源區,那瑪夏區

//基隆市  仁愛區,中正區,信義區,中山區,安樂區,暖暖區,七堵區
//新竹市  東區,北區,香山區
//嘉義市  東區,西區

//新竹縣   竹北市,竹東鎮,新埔鎮,關西鎮,湖口鄉,新豐鄉,峨眉鄉,寶山鄉,北埔鄉,芎林鄉,橫山鄉,尖石鄉,五峰鄉
//苗栗縣   苗栗市,頭份市,竹南鎮,後龍鎮,通霄鎮,苑裡鎮,卓蘭鎮,造橋鄉,西湖鄉,頭屋鄉,公館鄉,銅鑼鄉,三義鄉,大湖鄉,獅潭鄉,三灣鄉,南庄鄉,泰安鄉

//彰化縣  彰化市,員林市,和美鎮,鹿港鎮,溪湖鎮,二林鎮,田中鎮,北斗鎮,花壇鄉,芬園鄉,大村鄉,永靖鄉,伸港鄉,線西鄉,福興鄉,秀水鄉,埔心鄉,埔鹽鄉,大城鄉,芳苑鄉,竹塘鄉,社頭鄉,二水鄉,田尾鄉,埤頭鄉,溪州鄉
//南投縣  南投市,埔里鎮,草屯鎮,竹山鎮,集集鎮,名間鄉,鹿谷鄉,中寮鄉,魚池鄉,國姓鄉,水里鄉,信義鄉,仁愛鄉

//雲林縣  斗六市,斗南鎮,虎尾鎮,西螺鎮,土庫鎮,北港鎮,林內鄉,古坑鄉,大埤鄉,莿桐鄉,褒忠鄉,二崙鄉,崙背鄉,麥寮鄉,臺西鄉,東勢鄉,元長鄉,四湖鄉,口湖鄉,水林鄉
//嘉義縣  太保市,朴子市,布袋鎮,大林鎮,民雄鄉,溪口鄉,新港鄉,六腳鄉,東石鄉,義竹鄉,鹿草鄉,水上鄉,中埔鄉,竹崎鄉,梅山鄉,番路鄉,大埔鄉,阿里山鄉

//屏東縣  屏東市,潮州鎮,東港鎮,恆春鎮,萬丹鄉,長治鄉,麟洛鄉,九如鄉,里港鄉,鹽埔鄉,高樹鄉,萬巒鄉,內埔鄉,竹田鄉,新埤鄉,枋寮鄉,新園鄉,崁頂鄉,林邊鄉,南州鄉,佳冬鄉,琉球鄉,車城鄉,滿州鄉,枋山鄉,霧臺鄉,瑪家鄉,泰武鄉,來義鄉,春日鄉,獅子鄉,牡丹鄉,三地門鄉
//宜蘭縣  宜蘭市,頭城鎮,羅東鎮,蘇澳鎮,礁溪鄉,壯圍鄉,員山鄉,冬山鄉,五結鄉,三星鄉,大同鄉,南澳鄉

//花蓮縣  花蓮市,鳳林鎮,玉里鎮,新城鄉,吉安鄉,壽豐鄉,光復鄉,豐濱鄉,瑞穗鄉,富里鄉,秀林鄉,萬榮鄉,卓溪鄉
//臺東縣  臺東市,成功鎮,關山鎮,長濱鄉,池上鄉,東河鄉,鹿野鄉,卑南鄉,大武鄉,綠島鄉,太麻里鄉,海端鄉,延平鄉,金峰鄉,達仁鄉,蘭嶼鄉
$city=array("臺北市","新北市" ,"桃園市","臺中市","臺南市","高雄市","基隆市","新竹市","嘉義市","宜蘭縣"
    ,"新竹縣","苗栗縣","彰化縣","南投縣","雲林縣","嘉義縣","屏東縣","花蓮縣","臺東縣"
);
//臺北市
$area_01=array("中正區","大同區","中山區","松山區","大安區","萬華區","信義區","士林區","北投區",
    "內湖區","南港區","文山區");
//新北市
$area_02=array("板橋區","新莊區","中和區","永和區","土城區","樹林區","三峽區","鶯歌區","三重區",
    "蘆洲區","五股區","泰山區","林口區","八里區","淡水區","三芝區","石門區","金山區","萬里區","汐止區",
    "瑞芳區","貢寮區","平溪區","雙溪區","新店區","深坑區","石碇區","坪林區","烏來區");
//桃園市
$area_03=array("桃園區","中壢區","平鎮區","八德區","楊梅區","蘆竹區","大溪區","龍潭區","龜山區",
    "大園區","觀音區","新屋區","復興區");
//臺中市
$area_04=array("中區","東區","南區","西區","北區","北屯區","西屯區","南屯區","太平區","大里區",
    "霧峰區","烏日區","豐原區","后里區","石岡區","東勢區","新社區","潭子區","大雅區","神岡區",
    "大肚區","沙鹿區","龍井區","梧棲區","清水區","大甲區","外埔區","大安區","和平區");
//臺南市
$area_05=array("中西區","東區","南區","北區","安平區","安南區","永康區","歸仁區","新化區","左鎮區","
玉井區","楠西區","南化區","仁德區","關廟區","龍崎區","官田區","麻豆區","佳里區","西港區","七股區","將軍區",
    "學甲區","北門區","新營區","後壁區","白河區","東山區","六甲區","下營區","柳營區","鹽水區","善化區",
    "大內區","山上區","新市區","安定區");
//高雄市
$area_06=array("楠梓區","左營區","鼓山區","三民區","鹽埕區","前金區","新興區","苓雅區","前鎮區","旗津區",
    "小港區","鳳山區","大寮區","鳥松區","林園區","仁武區","大樹區","大社區",
    "岡山區","路竹區","橋頭區","梓官區","彌陀區","永安區","燕巢區","田寮區","阿蓮區","茄萣區",
    "湖內區","旗山區","美濃區","內門區","杉林區","甲仙區","六龜區","茂林區","桃源區","那瑪夏區");
//基隆市
$area_07=array("仁愛區","中正區","信義區","中山區","安樂區","暖暖區","七堵區");
//新竹市
$area_08=array("東區","北區","香山區");
//嘉義市
$area_09=array("東區","西區");
//新竹縣 
$area_10=array("竹北市","竹東鎮","新埔鎮","關西鎮","湖口鄉","新豐鄉","峨眉鄉","寶山鄉","北埔鄉",
    "芎林鄉","橫山鄉","尖石鄉","五峰鄉");
//苗栗縣
$area_11=array("苗栗市","頭份市","竹南鎮","後龍鎮","通霄鎮","苑裡鎮","卓蘭鎮","造橋鄉",
    "西湖鄉","頭屋鄉","公館鄉","銅鑼鄉","三義鄉","大湖鄉","獅潭鄉","三灣鄉","南庄鄉","泰安鄉");
//彰化縣
$area_12=array("彰化市","員林市","和美鎮","鹿港鎮","溪湖鎮","二林鎮","田中鎮","北斗鎮","花壇鄉",
    "芬園鄉", "大村鄉","永靖鄉","伸港鄉","線西鄉","福興鄉","秀水鄉","埔心鄉","埔鹽鄉","大城鄉",
    "芳苑鄉","竹塘鄉", "社頭鄉","二水鄉","田尾鄉","埤頭鄉","溪州鄉");
//南投縣
$area_13=array("南投市","埔里鎮","草屯鎮","竹山鎮","集集鎮","名間鄉","鹿谷鄉","中寮鄉","魚池鄉",
    "國姓鄉","水里鄉","信義鄉","仁愛鄉");
//雲林縣
$area_14=array("斗六市","斗南鎮","虎尾鎮","西螺鎮","土庫鎮","北港鎮","林內鄉","古坑鄉","大埤鄉",
    "莿桐鄉","褒忠鄉","二崙鄉","崙背鄉","麥寮鄉","臺西鄉","東勢鄉","元長鄉","四湖鄉","口湖鄉","水林鄉");
//嘉義縣
$area_15=array("太保市","朴子市","布袋鎮","大林鎮","民雄鄉","溪口鄉","新港鄉","六腳鄉","東石鄉","義竹鄉",
    "鹿草鄉","水上鄉","中埔鄉","竹崎鄉","梅山鄉","番路鄉","大埔鄉","阿里山鄉");
//屏東縣
$area_16=array("屏東市","潮州鎮","東港鎮","恆春鎮","萬丹鄉","長治鄉","麟洛鄉","九如鄉","里港鄉","鹽埔鄉",
    "高樹鄉","萬巒鄉","內埔鄉","竹田鄉","新埤鄉","枋寮鄉","新園鄉","崁頂鄉","林邊鄉","南州鄉","佳冬鄉",
    "琉球鄉","車城鄉","滿州鄉","枋山鄉","霧臺鄉","瑪家鄉","泰武鄉","來義鄉","春日鄉","獅子鄉","牡丹鄉","
        三地門鄉");
//宜蘭縣
$area_17=array("宜蘭市","頭城鎮","羅東鎮","蘇澳鎮","礁溪鄉","壯圍鄉","員山鄉","冬山鄉","五結鄉",
"三星鄉","大同鄉","南澳鄉");
//花蓮縣
$area_18=array("花蓮市","鳳林鎮","玉里鎮","新城鄉","吉安鄉","壽豐鄉","光復鄉","豐濱鄉",
"瑞穗鄉","富里鄉","秀林鄉","萬榮鄉","卓溪鄉");
//臺東縣
$area_19=array("臺東市","成功鎮","關山鎮","長濱鄉","池上鄉","東河鄉","鹿野鄉","卑南鄉",
"大武鄉","綠島鄉","太麻里鄉","海端鄉","延平鄉","金峰鄉","達仁鄉","蘭嶼鄉");

$addr="";
$n = rand(0,18);
//for ($i=0;$i<=$n; $i++){
echo $city[$n];
//}

//$addr=$area_01[$rand_01].$road;
$stree="中山路" ;
$road_number=rand(0,999);
$road = $stree.$road_number."號";
if ($city[$n] == "臺北市"){
    $rand_01=rand(0,11);
     $a=$area_01[$rand_01].$road;
     echo $addr=$city[$n].$a;
}else if ($city[$n] == "新北市"){
    $rand_02=rand(0,28);
    $a=$area_02[$rand_02].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "桃園市"){
    $rand_03=rand(0,12);
    $a=$area_03[$rand_03].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "臺中市"){
    $rand_04=rand(0,28);
    $a=$area_04[$rand_04].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "臺南市"){
    $rand_05=rand(0,35);
    $a=$area_05[$rand_05].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "高雄市"){
    $rand_06=rand(0,37);
    $a=$area_06[$rand_06].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "基隆市"){
    $rand_07=rand(0,6);
    $a=$area_07[$rand_07].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "新竹市"){
    $rand_08=rand(0,2);
    $a=$area_08[$rand_08].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "嘉義市"){
    $rand_09=rand(0,1);
    $a=$area_09[$rand_09].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "新竹縣"){
    $rand_10=rand(0,12);
    $a=$area_10[$rand_10].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "苗栗縣"){
    $rand_11=rand(0,17);
    $a=$area_11[$rand_11].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "彰化縣"){
    $rand_12=rand(0,26);
    $a=$area_12[$rand_12].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "南投縣"){
    $rand_13=rand(0,12);
    $a=$area_13[$rand_13].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "雲林縣"){
    $rand_14=rand(0,19);
    $a=$area_14[$rand_14].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "嘉義縣"){
    $rand_15=rand(0,17);
    $a=$area_15[$rand_15].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "屏東縣"){
    $rand_16=rand(0,32);
    $a=$area_16[$rand_16].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "宜蘭縣"){
    $rand_17=rand(0,11);
    $a=$area_17[$rand_17].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "花蓮縣"){
    $rand_18=rand(0,12);
    $a=$area_18[$rand_18].$road;
    echo $addr= $city[$n].$a;
}else if ($city[$n] == "臺東縣"){
    $rand_19=rand(0,15);
    $a=$area_19[$rand_19].$road;
    echo $addr= $city[$n].$a;
}else
    
    
$postcode = rand(0,999);    

    
    
    
?>